Revit 2026 API

# ParameterTypeIdBoundaryRestraintRotZ Property

---

"Z Spring Modulus"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId BoundaryRestraintRotZ { get; }
```
```vb
Public Shared ReadOnly Property BoundaryRestraintRotZ As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ BoundaryRestraintRotZ {
	ForgeTypeId^ get ();
}
```
```fsharp
static member BoundaryRestraintRotZ : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace